tests/UKHO.ERPFacade.API.FunctionalTests/ERPFacadeExpectedXmlFiles/Re-issue.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Z_ADDS_MAT_INFO xmlns="urn:sap-com:document:sap:rfc:functions">
      <IM_MATINFO xmlns="">
        <CORRID>ft-1bdfc9dd-9f4c-4c52-a32e-b2a924b7d5b6</CORRID>
        <NOOFACTIONS>4</NOOFACTIONS>
        <RECDATE>20241006</RECDATE>
        <RECTIME>053558</RECTIME>
        <ORG>UKHO</ORG>
        <ACTIONITEMS>
          <Item>
            <ACTIONNUMBER>1</ACTIONNUMBER>
            <ACTION>CREATE ENC CELL</ACTION>
            <PRODUCT>ENC CELL</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB1REISS</CHILDCELL>
            <PRODUCTNAME>GB1REISS</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY>GB</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE>Not specified</TITLE>
            <EDITIONNO>10</EDITIONNO>
            <UPDATENO>3</UPDATENO>
            <UNITTYPE></UNITTYPE>
            <WEEKNO>202409</WEEKNO>
            <VALIDFROM>20240229</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY>ThisWillBeRetrievedFromKeyVaultBeforeAssertion</ACTIVEKEY>
            <NEXTKEY>ThisWillBeRetrievedFromKeyVaultBeforeAssertion</NEXTKEY>
          </Item>
          <Item>
            <ACTIONNUMBER>2</ACTIONNUMBER>
            <ACTION>CREATE AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL></CHILDCELL>
            <PRODUCTNAME>GB1REISS</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY>GB</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE>Not specified</TITLE>
            <EDITIONNO></EDITIONNO>
            <UPDATENO></UPDATENO>
            <UNITTYPE>AVCS Units Overview</UNITTYPE>
            <WEEKNO>202409</WEEKNO>
            <VALIDFROM>20240229</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY></ACTIVEKEY>
            <NEXTKEY></NEXTKEY>
          </Item>
          <Item>
            <ACTIONNUMBER>3</ACTIONNUMBER>
            <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB1REISS</CHILDCELL>
            <PRODUCTNAME>GB1REISS</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY></AGENCY>
            <PROVIDER></PROVIDER>
            <ENCSIZE></ENCSIZE>
            <TITLE></TITLE>
            <EDITIONNO></EDITIONNO>
            <UPDATENO></UPDATENO>
            <UNITTYPE></UNITTYPE>
            <WEEKNO>202409</WEEKNO>
            <VALIDFROM>20240229</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY></ACTIVEKEY>
            <NEXTKEY></NEXTKEY>
          </Item>
          <Item>
            <ACTIONNUMBER>4</ACTIONNUMBER>
            <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB1REISS</CHILDCELL>
            <PRODUCTNAME>PAYSF</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY></AGENCY>
            <PROVIDER></PROVIDER>
            <ENCSIZE></ENCSIZE>
            <TITLE></TITLE>
            <EDITIONNO></EDITIONNO>
            <UPDATENO></UPDATENO>
            <UNITTYPE></UNITTYPE>
            <WEEKNO>202409</WEEKNO>
            <VALIDFROM>20240229</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY></ACTIVEKEY>
            <NEXTKEY></NEXTKEY>
          </Item>
        </ACTIONITEMS>
      </IM_MATINFO>
    </Z_ADDS_MAT_INFO>
  </soap:Body>
</soap:Envelope>
